package xxx;
/*Создайте программу, которая будет генерировать и выводить на экран 
 * вещественное псевдослучайное число из промежутка [-3;3).
*/
public class Zadacha8 {

	public static void main(String[] args) {
		float a =(float)Math.random()*6-3;
		System.out.print(a);
	}

}
