package xxx;
/*Создать программу, проверяющую и сообщающую на экран, 
 * является ли целое число записанное в переменную n, 
 * чётным либо нечётным.
 * 
 */
public class Zadacha13 {

	public static void main(String[] args) {
		int n;
		n=150;
		if( n%2==0){
			System.out.println("Chetnoe!!!");
		}
		else {
			System.out.println("Nechetnoe!!");
		}
			

	}

}
