package xxx;
/*В переменных a и b лежат положительные длины катетов прямоугольного треугольника.
Вычислить и вывести на экран площадь треугольника и его периметр.
*/
public class Zadacha12 {

	public static void main(String[] args) {
		int a=4;
int b =3;
int s=(a*b)/2;
double c=Math.sqrt(a*a+b*b);
	System.out.println(s+" Perimetr  "+c+a+b);

	}

}
