package xxx;
/*Создайте программу, округляющую число n до ближайшего целого и выводящую результат на экран.
*/
public class Zadacha6 {

	public static void main(String[] args) {
		double a =44.5;
		int x =(int)(a+0.5);
		System.out.print("Оклуглив "+a+" получим "+x);

	}

}
